人物 = (627, 30, 662, 45)  #人物判断城镇
设置_选择角色 = (374, 490)
赛丽亚 = (424, 178, 466, 198)  #赛丽亚房间
公告_关闭 = (370, 449, 418, 468)  #判断每天的公告
比拉谢尔面板 = (579, 212)  #通过传送器传送到比拉谢尔号，面板的坐标
比拉谢尔面板_毁坏的克洛诺斯岛 = (191, 290)
所选地图名字 = (53, 290, 184, 316)
地图名 = "海伯伦的预言所"  #要刷的地图


class 路径算法:
    def __init__(self, 地图数据, 起点, 终点):
        self.地图数据 = 地图数据
        self.起点 = 起点
        self.终点 = 终点


海伯伦的预言所 = 路径算法([
    [1, 1, 1, 1, 1],
    [1, 0, 0, 0, 0],
    [1, 0, 0, 0, 1],
    [1, 0, 0, 0, 1],
    [1, 0, 1, 1, 1]
], [4, 1], [1, 4])
海伯伦的预言所小地图位置 = (701, 26, 794, 121)
小地图位置 = 海伯伦的预言所小地图位置
小地图路径 = 海伯伦的预言所
#下述数据暂定，等待修改
小地图角色颜色 = (50,150,200) #小于15，大于150，200才行
小地图Boss颜色 = (200,100,20)  #>200 <100,<20
小地图遍历步长 = 2
技能位置 = (299, 533, 514, 593)
技能颜色遍历步长 = 2
技能颜色 = (255, 255, 107)
技能字典 = {(0, 0): 'q', (0, 1): 'w', (0, 2): 'e', (0, 3): 'r', (0, 4): 't', (0, 5): 'y', (0, 6): 'ctrl',
            (1, 0): 'a', (1, 1): 's', (1, 2): 'd', (1, 3): 'f', (1, 4): 'g', (1, 5): 'h', (1, 6): 'alt'}
疲劳位置 = {"top": 594, "left": 657, "width": 1, "height": 1}
疲劳颜色 = (0, 184, 215)
跳过翻牌 = (727,52,761,72)
